* Org-Mode Bitcoin Spreadsheet

  Spreadsheet updates with pricing data from bitcoin charts API.

#+name: mtgox-price
#+BEGIN_SRC clojure
  (require 'clj-http.client)
  
  (->> (clj-http.client/get "http://api.bitcoincharts.com/v1/markets.json" {:as :json})
       :body
       (filter #(= "mtgoxUSD" (:symbol %)))
       first
       :close)
#+END_SRC

#+RESULTS: mtgox-price
: 94.93315

|-----------------+------+--------------------|
| Account         |  Qty | Value (@$94.93315) |
|-----------------+------+--------------------|
| mtgox           |    1 |              94.93 |
| blockchain.info |    2 |             189.87 |
|-----------------+------+--------------------|
| Total           | 3.00 |              284.8 |
|-----------------+------+--------------------|
#+TBLFM: @4$2=vsum(@2$2..@3$2);N%.2f::$3=vsum(@2..@3)::@1$3='(format "Value (@$%s)" btc-pr))::@2$3..@3$3='(* $2 (string-to-number (setq btc-pr (sbe "mtgox-price"))));N%.2f
